app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT ?  [["LIMIT", 10]]
---
  def index
    @articles = Article.includes(:user).order(created_at: :desc).limit(10)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "content", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", ""], ["content", ""], ["description", ""], ["user_id", 1], ["created_at", "2024-02-13 00:39:36.381229"], ["updated_at", "2024-02-13 00:39:36.381229"]]
---
  def create
    current_user_id = 1
    @user = User.find(current_user_id)
    @article = @user.articles.create(article_params)